app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(mutter_id: params[:mutter_id])
---
INSERT INTO "favorites" ("user_id", "mutter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 29], ["mutter_id", 15], ["created_at", "2018-04-24 06:16:00.891844"], ["updated_at", "2018-04-24 06:16:00.891844"]]

  def destroy
    favorite = current_user.favorites.find_by(mutter_id: params[:mutter_id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."mutter_id" = $2 LIMIT $3  [["user_id", 29], ["mutter_id", 15], ["LIMIT", 1]]