app/controllers/mutters_controller.rb

SELECT  "mutters".* FROM "mutters" ORDER BY "mutters"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    if logged_in?
      @mutters = Mutter.all

INSERT INTO "mutters" ("content", "user_id", "image") VALUES ($1, $2, $3) RETURNING "id"  [["content", "テスト"], ["user_id", 3], ["image", "404.png"]]
---
  def create
    @mutter = Mutter.new(mutter_params)
    @mutter.image.retrieve_from_cache!  params[:cache][:image]
    @mutter.user_id = current_user.id
    if @mutter.save(mutter_params)

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."mutter_id" = $2 LIMIT $3  [["user_id", 29], ["mutter_id", 11], ["LIMIT", 1]]
---
  def show
    if logged_in?
      @favorite = current_user.favorites.find_by(mutter_id: @mutter.id)

UPDATE "mutters" SET "content" = $1 WHERE "mutters"."id" = $2  [["content", "testtest"], ["id", 2]]
---
  def update
    if @mutter.update(mutter_params)

DELETE FROM "mutters" WHERE "mutters"."id" = $1  [["id", 1]]
---
  def destroy
    @mutter.destroy

SELECT  "mutters".* FROM "mutters" WHERE "mutters"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_mutter
    @mutter = Mutter.find(params[:id])