app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "password_digest" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$tx7WqkruwG.JHuugJB0idu1Yr0lquJHd7HYqEmRKR1sd9QbCLU3Zy"], ["image", "404.png"], ["updated_at", "2018-05-02 06:09:39.332767"], ["id", 3]]
---
  def update

    @user.password = current_user.password_digest
    if @user.update(user_params)